MarioCruz/TherminEsp/sdkconfig.defaults
# TherminEsp — ESP32-S31-Korvo. Peripheral-critical settings mirror the
# wedding-recorder project, which proved them on this exact board + IDF v6.1-beta1.
CONFIG_IDF_TARGET="esp32s31"

# Flash: 16 MB, QIO (matches the module)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table (single large app + nvs)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 16 MB octal PSRAM @ 250 MHz. XIP-from-PSRAM OFF so code runs from flash.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=12768
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y

CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# LVGL adapter: filesystem + image decoder
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FS=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_DECODER=y

# Camera sensor: 720p JPEG is the only mode this DVP driver actually accepts
# (240x240 RGB565 — which would avoid the JPEG decode step entirely — is
# rejected outright: "input width=240, height=240 is not supported". See the
# README's hard-won lessons. Left un-enabled here since camera.c never
# attempts it.)
CONFIG_CAMERA_OV3660=y
CONFIG_CAMERA_OV3660_DVP_JPEG_1280X720_12FPS=y
CONFIG_CAMERA_OV3660_DVP_DEFAULT_FMT_JPEG_1280X720_12FPS=y

# LVGL fonts for the theremin UI
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
